Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTC/svd/PIC32CX1025MTC128.svd
               <register>
                  <name>P_CFGR</name>
                  <description>PIO Privilege Configuration Register (p_iogroup = 0)</description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>FUNC</name>
                        <description>I/O Line Function</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>FUNCSelect</name>
                           <enumeratedValue>
                              <name>GPIO</name>
                              <description>Select the PIO mode for the selected I/O lines.</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PERIPH_A</name>
                              <description>Select the peripheral A for the selected I/O lines.</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PERIPH_B</name>
                              <description>Select the peripheral B for the selected I/O lines.</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PERIPH_C</name>
                              <description>Select the peripheral C for the selected I/O lines.</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PERIPH_D</name>
                              <description>Select the peripheral D for the selected I/O lines.</description>
                              <value>0x4</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DIR</name>
                        <description>Direction</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>DIRSelect</name>
                           <enumeratedValue>
                              <name>INPUT</name>
                              <description>The selected I/O lines are pure inputs.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>OUTPUT</name>
                              <description>The selected I/O lines are enabled in output.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>PUEN</name>
                        <description>Pull-Up Enable</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>PUENSelect</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>Pull-Up is disabled for the selected I/O lines.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLED</name>
                              <description>Pull-Up is enabled for the selected I/O lines.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>PDEN</name>
                        <description>Pull-Down Enable</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>PDENSelect</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>Pull-Down is disabled for the selected I/O lines.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLED</name>
                              <description>Pull-Down is enabled for the selected I/O lines only if PUEN is 0.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>IFEN</name>
                        <description>Input Filter Enable</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>IFENSelect</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>The input filter is disabled for the selected I/O lines.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLED</name>
                              <description>The input filter is enabled for the selected I/O lines.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>IFSCEN</name>
                        <description>Input Filter Slow Clock Enable</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OPD</name>
                        <description>Open-Drain</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>OPDSelect</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>The open-drain is disabled for the selected I/O lines. I/O lines are driven at high- and low-level.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLED</name>
                              <description>The open-drain is enabled for the selected I/O lines. I/O lines are driven at low-level only.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>SCHMITT</name>
                        <description>Schmitt Trigger</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>SCHMITTSelect</name>
                           <enumeratedValue>
                              <name>ENABLED</name>
                              <description>Schmitt trigger is enabled for the selected I/O lines.</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>Schmitt trigger is disabled for the selected I/O lines.</description>
                              <value>0x1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>SLEWRATE</name>
                        <description>Slew Rate</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>SLEWRATESelect</name>
                           <enumeratedValue>
                              <name>FAST</name>
                              <description>Slow slew rate</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MEDIUMFAST</name>
                              <description>Medium-fast slew rate</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MEDIUM</name>
                              <description>Medium slew rate</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SLOW</name>
                              <description>Slow slew rate</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>EVTSEL</name>
                        <description>Event Selection</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>EVTSELSelect</name>
                           <enumeratedValue>
                              <name>FALLING</name>
                              <description>Event detection on input falling edge</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>RISING</name>
                              <description>Event detection on input rising edge</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>BOTH</name>
                              <description>Event detection on input both edge</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>LOW</name>
                              <description>Event detection on low level input</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HIGH</name>
                              <description>Event detection on high level input</description>
                              <value>0x4</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>PCFS</name>
                        <description>Physical Configuration Freeze Status (read-only)</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>PCFSSelect</name>
                           <enumeratedValue>
                              <name>NOT_FROZEN</name>
                              <description>The fields are not frozen and can be written for this I/O line.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FROZEN</name>
                              <description>The fields are frozen and cannot be written for this I/O line. Only a hardware reset can release these fields.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>ICFS</name>
                        <description>Interrupt Configuration Freeze Status (read-only)</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>ICFSSelect</name>
                           <enumeratedValue>
                              <name>NOT_FROZEN</name>
                              <description>The fields are not frozen and can be written for this I/O line.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FROZEN</name>
                              <description>The fields are frozen and cannot be written for this I/O line. Only a hardware reset can release these fields.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>P_PDSR</name>
                  <description>PIO Privilege Pin Data Status Register (p_iogroup = 0)</description>
                  <addressOffset>0x8</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>P0</name>
                        <description>Input Data Status</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P1</name>
                        <description>Input Data Status</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P2</name>
                        <description>Input Data Status</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P3</name>
                        <description>Input Data Status</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P4</name>
                        <description>Input Data Status</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P5</name>
                        <description>Input Data Status</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P6</name>
                        <description>Input Data Status</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P7</name>
                        <description>Input Data Status</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P8</name>
                        <description>Input Data Status</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P9</name>
                        <description>Input Data Status</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P10</name>
                        <description>Input Data Status</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P11</name>
                        <description>Input Data Status</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P12</name>
                        <description>Input Data Status</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P13</name>
                        <description>Input Data Status</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P14</name>
                        <description>Input Data Status</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P15</name>
                        <description>Input Data Status</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P16</name>
                        <description>Input Data Status</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P17</name>
                        <description>Input Data Status</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P18</name>
                        <description>Input Data Status</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P19</name>
                        <description>Input Data Status</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P20</name>
                        <description>Input Data Status</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P21</name>
                        <description>Input Data Status</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P22</name>
                        <description>Input Data Status</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P23</name>
                        <description>Input Data Status</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P24</name>
                        <description>Input Data Status</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P25</name>
                        <description>Input Data Status</description>
                        <bitOffset>25</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P26</name>
                        <description>Input Data Status</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P27</name>
                        <description>Input Data Status</description>
                        <bitOffset>27</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P28</name>
                        <description>Input Data Status</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P29</name>
                        <description>Input Data Status</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P30</name>
                        <description>Input Data Status</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P31</name>
                        <description>Input Data Status</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
